lib/tasks/simulate_race.rake

INSERT INTO "product_variants" ("name", "inventory_count", "created_at", "updated_at") VALUES ('Hot Item', 100, '2025-12-02 18:25:52.831339', '2025-12-02 18:25:52.831339') RETURNING "id"
SELECT "product_variants".* FROM "product_variants" ORDER BY "product_variants"."id" ASC LIMIT 1
UPDATE "product_variants" SET "inventory_count" = 100, "updated_at" = '2025-12-02 18:26:09.464487' WHERE "product_variants"."id" = 1
SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."id" = 1 LIMIT 1
UPDATE "product_variants" SET "inventory_count" = COALESCE("product_variants"."inventory_count", 0) - 1 WHERE "product_variants"."id" = 1
---
  task race: :environment do
    puts "Starting race condition simulation..."

    # 1. Reset ProductVariant
    # We use a specific ID to ensure we're always working on the same record
    variant = ProductVariant.first_or_create!(name: "Hot Item", inventory_count: 100)
    variant.update!(inventory_count: 100)
    puts "Initial inventory: #{variant.inventory_count}"

    # 2. Spawn 150 concurrent threads (Increased from 50 to ensure overselling/race condition)
    threads = []
    150.times do |i|
      threads << Thread.new do
        # 3. Try to purchase
        # We instantiate a new connection or ensure we are using a separate connection/model instance
        # Rails connection pool should handle this.
        Rails.application.executor.wrap do
          v = ProductVariant.find(variant.id)

          if v.inventory_count > 0
            # Artificial delay to heighten race condition chance
            sleep(rand(0.01..0.05))
            v.decrement!(:inventory_count)