lib/tasks/verify_fix.rake

  task fix: :environment do
    puts "Starting verification of the fix..."

    # 1. Reset ProductVariant and Redis
    variant = ProductVariant.first_or_create!(name: "Hot Item", inventory_count: 100)
    variant.update!(inventory_count: 100)
---
SELECT "product_variants".* FROM "product_variants" ORDER BY "product_variants"."id" ASC LIMIT 1
UPDATE "product_variants" SET "inventory_count" = 100, "updated_at" = '2025-12-02 18:28:54.498242' WHERE "product_variants"."id" = 1