app/jobs/order_creation_job.rb

INSERT INTO "orders" ("product_variant_id", "status", "created_at", "updated_at") VALUES (1, 'pending', '2025-12-02 18:29:22.627128', '2025-12-02 18:29:22.627128') RETURNING "id"
SELECT "product_variants".* FROM "product_variants" WHERE "product_variants"."id" = 1 LIMIT 1
UPDATE "product_variants" SET "inventory_count" = COALESCE("product_variants"."inventory_count", 0) - 1 WHERE "product_variants"."id" = 1
---
  def perform(variant_id)
    # 1. Create the Order
    # In a real app, we might pass user_id, payment_info, etc.
    Order.create!(product_variant_id: variant_id, status: 'pending')

    # 2. Sync inventory to DB (Optional but good for consistency)
    # Since we already decremented in Redis, we should reflect that in DB eventually.
    # However, simply decrementing blindly might be risky if we rely solely on Redis.
    # But given the prompt says "sync the final count to PostgreSQL", we should do it.
    # We use decrement! which is atomic in DB, but we don't check for > 0 here
    # because Redis already guaranteed the reservation.

    ProductVariant.find(variant_id).decrement!(:inventory_count)